{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 224, 224, 3], "dtype": "float32"}}, {"name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block1_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 64, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block1_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 64, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": false}}, {"name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block2_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 128, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block2_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 128, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": false}}, {"name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block3_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 256, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block3_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 256, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block3_conv3", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 256, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": false}}, {"name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block4_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 512, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block4_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 512, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block4_conv3", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": false, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 512, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": false}}, {"name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block5_conv1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 512, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block5_conv2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 512, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "block5_conv3", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "filters": 512, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null}}, {"name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}}, {"name": "flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten", "data_format": "channels_last", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "trainable": true, "units": 512, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "activity_regularizer": null}}, {"name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "seed": null, "trainable": true, "noise_shape": null}}, {"name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "config": {"name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "trainable": true, "units": 6, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "activity_regularizer": null}}], "input_layers": [["input_1", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"lr": 9.999999747378752e-05, "nesterov": false, "momentum": 0.8999999761581421, "decay": 0.0}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of27.bin", "group1-shard2of27.bin", "group1-shard3of27.bin", "group1-shard4of27.bin", "group1-shard5of27.bin", "group1-shard6of27.bin", "group1-shard7of27.bin", "group1-shard8of27.bin", "group1-shard9of27.bin", "group1-shard10of27.bin", "group1-shard11of27.bin", "group1-shard12of27.bin", "group1-shard13of27.bin", "group1-shard14of27.bin", "group1-shard15of27.bin", "group1-shard16of27.bin", "group1-shard17of27.bin", "group1-shard18of27.bin", "group1-shard19of27.bin", "group1-shard20of27.bin", "group1-shard21of27.bin", "group1-shard22of27.bin", "group1-shard23of27.bin", "group1-shard24of27.bin", "group1-shard25of27.bin", "group1-shard26of27.bin", "group1-shard27of27.bin"], "weights": [{"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32"}, {"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32"}, {"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [25088, 512], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [512, 6], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [6], "dtype": "float32"}]}]}